#!./Debug/zhscript2 --。
定义测试、代码以下代码
	显示‘代码’换行。
	赋予果以解释‘代码’。
	显示‘果’先如果‘果’等于错那么“   <- ”ESC[031;47m程序有问题“了”ESC[m了换行换行。
上代码。

测试“如果1大于0那么对否则错。”。
测试“如果1那么对否则错。”。
测试“如果0那么错否则对。”。
测试“如果1小于2并且0那么错否则对。”。
测试“如果1111小于2222并且小于等于3333并且不大于4444那么对否则错。”。
测试“如果1111大于2那么对否则错。”。
测试“如果1不等于2那么对否则错。”。
测试“如果-1大于-2那么对否则错。”。
测试“如果-1大于0那么错否则对。”。

测试“如果0000等于0000那么对否则错。”。
测试“如果0010大于0002那么对否则错。”。
测试“如果0010a大于0002bbbb那么对否则错。”。

测试“如果0等于0000那么对否则错。”。

测试“如果1a等于2b那么错否则对。”。
测试“如果1a小于等于2b那么对否则错。”。
测试“如果1a小于2b那么对否则错。”。
测试“如果1a大于等于2b那么错否则对。”。
测试“如果1a大于2b那么错否则对。”。
测试“如果1a不小于2b那么错否则对。”。

测试“如果1a等于1b那么错否则对。”。
测试“如果1ab等于1ab那么对否则错。”。
测试“如果1aaaab小于1aaaac那么对否则错。”。

测试“如果0001等于1那么对否则错。”。
测试“如果0001a大于1a那么对否则错。”。
测试“如果1a小于0001a那么对否则错。”。

测试“如果0.1小于0.2那么对否则错。”。

测试“如果a小于b那么对否则错。”。
测试“如果aaaa小于b那么对否则错。”。
